
###################################################################
########################### Variables #############################
###################################################################
set SSLIB "/home/IC/AMBA-APB/Fromal verification (Post-SYN)/std_cells/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db"
set TTLIB "/home/IC/AMBA-APB/Fromal verification (Post-SYN)/std_cells/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
set FFLIB "/home/IC/AMBA-APB/Fromal verification (Post-SYN)/std_cells/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db"


###################################################################
############################ Guidance #############################
###################################################################

# Synopsys setup variable
set synopsys_auto_setup true


# Formality Setup File
set_svf "/home/IC/AMBA-APB/synthesis/syn/APB_TOP.svf"
###################################################################
###################### Reference Container ########################
###################################################################

# Read Reference Design Verilog Files
read_verilog -container Ref "/home/IC/AMBA-APB/rtl/APB_MASTER.v"
read_verilog -container Ref "/home/IC/AMBA-APB/rtl/APB_SLAVE.v"
read_verilog -container Ref "/home/IC/AMBA-APB/rtl/APB_Top.v"
# Read Reference technology libraries

read_db -container Ref $SSLIB
read_db -container Ref $TTLIB
read_db -container Ref $FFLIB
# set the top Reference Design 
set_reference_design APB_top
set_top APB_top


###################################################################
#################### Implementation Container #####################
###################################################################

# Read Implementation Design Files
read_verilog -netlist -container Imp "/home/IC/AMBA-APB/synthesis/syn/APB_Top.v"
# Read Implementation technology libraries
read_db -container Imp $SSLIB
read_db -container Imp $TTLIB
read_db -container Imp $FFLIB
# set the top Implementation Design
set_implementation_design APB_top
set_top APB_top

###################### Matching Compare points ####################
match


######################### Run Verification ########################

set successful [verify]
if {!$successful} {
diagnose
analyze_points -failing
}

########################### Reporting ############################# 
report_passing_points > "passing_points.rpt"
report_failing_points > "failing_points.rpt"
report_aborted_points > "aborted_points.rpt"
report_unverified_points > "unverified_points.rpt"


start_gui

