###################################################################

# Created by write_sdc on Wed Feb 26 23:00:08 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -max_library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -min scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -min_library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c
set_wire_load_model -name tsmc13_wl40 -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports transfer]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports READ_WRITE]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_paddr[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_paddr[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_paddr[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_paddr[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_paddr[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_paddr[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_paddr[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_paddr[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_data[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_data[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_data[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_data[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_data[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_data[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_data[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_write_data[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_read_paddr[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_read_paddr[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_read_paddr[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_read_paddr[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_read_paddr[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_read_paddr[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_read_paddr[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {apb_read_paddr[0]}]
set_load -pin_load 0.5 [get_ports {apb_read_data_out[7]}]
set_load -pin_load 0.5 [get_ports {apb_read_data_out[6]}]
set_load -pin_load 0.5 [get_ports {apb_read_data_out[5]}]
set_load -pin_load 0.5 [get_ports {apb_read_data_out[4]}]
set_load -pin_load 0.5 [get_ports {apb_read_data_out[3]}]
set_load -pin_load 0.5 [get_ports {apb_read_data_out[2]}]
set_load -pin_load 0.5 [get_ports {apb_read_data_out[1]}]
set_load -pin_load 0.5 [get_ports {apb_read_data_out[0]}]
create_clock [get_ports PCLK]  -period 20  -waveform {0 10}
set_clock_latency 0  [get_clocks PCLK]
set_clock_uncertainty -setup 0.2  [get_clocks PCLK]
set_clock_uncertainty -hold 0.1  [get_clocks PCLK]
set_clock_transition -max -rise 0.05 [get_clocks PCLK]
set_clock_transition -min -rise 0.05 [get_clocks PCLK]
set_clock_transition -max -fall 0.05 [get_clocks PCLK]
set_clock_transition -min -fall 0.05 [get_clocks PCLK]
group_path -name INOUT  -from [list [get_ports PCLK] [get_ports transfer] [get_ports PRESETn] [get_ports READ_WRITE] [get_ports {apb_write_paddr[7]}] [get_ports {apb_write_paddr[6]}] [get_ports {apb_write_paddr[5]}] [get_ports {apb_write_paddr[4]}] [get_ports {apb_write_paddr[3]}] [get_ports {apb_write_paddr[2]}] [get_ports {apb_write_paddr[1]}] [get_ports {apb_write_paddr[0]}] [get_ports {apb_write_data[7]}] [get_ports {apb_write_data[6]}] [get_ports {apb_write_data[5]}] [get_ports {apb_write_data[4]}] [get_ports {apb_write_data[3]}] [get_ports {apb_write_data[2]}] [get_ports {apb_write_data[1]}] [get_ports {apb_write_data[0]}] [get_ports {apb_read_paddr[7]}] [get_ports {apb_read_paddr[6]}] [get_ports {apb_read_paddr[5]}] [get_ports {apb_read_paddr[4]}] [get_ports {apb_read_paddr[3]}] [get_ports {apb_read_paddr[2]}] [get_ports {apb_read_paddr[1]}] [get_ports {apb_read_paddr[0]}] [get_ports SI] [get_ports SE] [get_ports scan_clk] [get_ports scan_rst] [get_ports test_mode]]  -to [list [get_ports SO] [get_ports {apb_read_data_out[7]}] [get_ports {apb_read_data_out[6]}] [get_ports {apb_read_data_out[5]}] [get_ports {apb_read_data_out[4]}] [get_ports {apb_read_data_out[3]}] [get_ports {apb_read_data_out[2]}] [get_ports {apb_read_data_out[1]}] [get_ports {apb_read_data_out[0]}]]
group_path -name INREG  -from [list [get_ports PCLK] [get_ports transfer] [get_ports PRESETn] [get_ports READ_WRITE] [get_ports {apb_write_paddr[7]}] [get_ports {apb_write_paddr[6]}] [get_ports {apb_write_paddr[5]}] [get_ports {apb_write_paddr[4]}] [get_ports {apb_write_paddr[3]}] [get_ports {apb_write_paddr[2]}] [get_ports {apb_write_paddr[1]}] [get_ports {apb_write_paddr[0]}] [get_ports {apb_write_data[7]}] [get_ports {apb_write_data[6]}] [get_ports {apb_write_data[5]}] [get_ports {apb_write_data[4]}] [get_ports {apb_write_data[3]}] [get_ports {apb_write_data[2]}] [get_ports {apb_write_data[1]}] [get_ports {apb_write_data[0]}] [get_ports {apb_read_paddr[7]}] [get_ports {apb_read_paddr[6]}] [get_ports {apb_read_paddr[5]}] [get_ports {apb_read_paddr[4]}] [get_ports {apb_read_paddr[3]}] [get_ports {apb_read_paddr[2]}] [get_ports {apb_read_paddr[1]}] [get_ports {apb_read_paddr[0]}] [get_ports SI] [get_ports SE] [get_ports scan_clk] [get_ports scan_rst] [get_ports test_mode]]
group_path -name REGOUT  -to [list [get_ports SO] [get_ports {apb_read_data_out[7]}] [get_ports {apb_read_data_out[6]}] [get_ports {apb_read_data_out[5]}] [get_ports {apb_read_data_out[4]}] [get_ports {apb_read_data_out[3]}] [get_ports {apb_read_data_out[2]}] [get_ports {apb_read_data_out[1]}] [get_ports {apb_read_data_out[0]}]]
set_input_delay -clock PCLK  4  [get_ports transfer]
set_input_delay -clock PCLK  4  [get_ports READ_WRITE]
set_input_delay -clock PCLK  4  [get_ports {apb_write_paddr[7]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_paddr[6]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_paddr[5]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_paddr[4]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_paddr[3]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_paddr[2]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_paddr[1]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_paddr[0]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_data[7]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_data[6]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_data[5]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_data[4]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_data[3]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_data[2]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_data[1]}]
set_input_delay -clock PCLK  4  [get_ports {apb_write_data[0]}]
set_input_delay -clock PCLK  4  [get_ports {apb_read_paddr[7]}]
set_input_delay -clock PCLK  4  [get_ports {apb_read_paddr[6]}]
set_input_delay -clock PCLK  4  [get_ports {apb_read_paddr[5]}]
set_input_delay -clock PCLK  4  [get_ports {apb_read_paddr[4]}]
set_input_delay -clock PCLK  4  [get_ports {apb_read_paddr[3]}]
set_input_delay -clock PCLK  4  [get_ports {apb_read_paddr[2]}]
set_input_delay -clock PCLK  4  [get_ports {apb_read_paddr[1]}]
set_input_delay -clock PCLK  4  [get_ports {apb_read_paddr[0]}]
set_output_delay -clock PCLK  4  [get_ports {apb_read_data_out[7]}]
set_output_delay -clock PCLK  4  [get_ports {apb_read_data_out[6]}]
set_output_delay -clock PCLK  4  [get_ports {apb_read_data_out[5]}]
set_output_delay -clock PCLK  4  [get_ports {apb_read_data_out[4]}]
set_output_delay -clock PCLK  4  [get_ports {apb_read_data_out[3]}]
set_output_delay -clock PCLK  4  [get_ports {apb_read_data_out[2]}]
set_output_delay -clock PCLK  4  [get_ports {apb_read_data_out[1]}]
set_output_delay -clock PCLK  4  [get_ports {apb_read_data_out[0]}]
